{"slug":"habitat","metadata":{"name":"Habitat","abbreviation":"Habitat","projectName":"habitat","launched":"2016-04-29T00:00:00.000Z","icon":"/projects/habitat/habitat-icon.png","summary":"Habitat - Where files live. A simple and yet powerful self-contained object storage management system.","description":"<p>Habitat is a simple and yet powerful self-contained object storage management system.\nBased on Amazon Web Services, it is capable of virtually unlimited storage.\nInstead of a large centralized management system, Habitat can be used as a local repository\nfor a single application or it can be shared and used with many clients.</p>\n<p>Habitat is best used for situations where the client producers and consumers of the files\ndo not require a file system protocol interface and can use http(s) to access the store.</p>\n","dateString":"Fri Apr 29 2016","title":"Habitat","styles":[],"scripts":[]},"html":"<h2 id=\"key-features\">Key features</h2>\n<ul>\n<li>Upload/download via http(s) from any client that can issue HTTP POST requests</li>\n<li>Upload/download via any tools that support writing/reading from S3. For example:<ul>\n<li>Web browser (via a Java applet <a href=\"http://docs.aws.amazon.com/AmazonS3/latest/UG/enhanced-uploader.htm\">http://docs.aws.amazon.com/AmazonS3/latest/UG/enhanced-uploader.htm</a>)</li>\n<li>Windows client: <a href=\"http://s3browser.com\">http://s3browser.com</a></li>\n<li>Windows client: <a href=\"http://www.cloudberrylab.com/free-amazon-s3-explorer-cloudfront-IAM.aspx#close\">http://www.cloudberrylab.com/free-amazon-s3-explorer-cloudfront-IAM.aspx#close</a></li>\n<li>Future: Web browser: we are building a web client that we will likely open source</li>\n</ul>\n</li>\n<li>Future: upload via file interface where a file is stored by dropping in a temp directory</li>\n<li>Future: checkout a collection of files into a local file system (setting user/group permissions as desired)</li>\n<li>Immutable reference key for each stored file</li>\n<li>Stores metadata about the object from a variety of sources:<ul>\n<li>Parsed from the file name (customized parsing via a regular expression)</li>\n<li>Extracted from the file contents (via a custom plugin)</li>\n<li>Exracted from a companion metadata file (uploaded either before or after the data file)</li>\n<li>Extracted from the write action event itself</li>\n<li>Extracted from the S3 metadata attribute on the object</li>\n</ul>\n</li>\n<li>Life cycle management to reduce to lower cost storage or to delete after defined time periods</li>\n<li>Get file or file list based on metadata search</li>\n<li>Search index using a discrete or shared Elastic Search instance</li>\n<li>Future: Supports object versioning</li>\n<li>Easily customized to tailor to unique requirements (config file driven, with custom plugins)</li>\n<li>Supports saving a shadow copy of metadata into the S3 object metadata in addition to the Elastic Search index</li>\n</ul>\n"}