{"slug":"jenkins-lsci","metadata":{"name":"Jenkins-LSCI","abbreviation":"Jenkins-LSCI","projectName":"Jenkins-LSCI","launched":"2016-08-30T00:00:00.000Z","icon":"/projects/jenkins-lsci/Jenkins_LifeSci.png","summary":"Life Science Continuous Integration -- Workflows and data pipelines for life science research.","description":"<p>Jenkins-LSCI enables research scientists to build workflows and data pipelines on the same robust framework and plugin ecosystem as Jenkins-CI the widely used continuous integration server that supports building, deploying and automating any software project.</p>\n","dateString":"Tue Aug 30 2016","title":"Jenkins-LSCI","styles":[],"scripts":[]},"html":"<h2 id=\"what-can-jenkins-lsci-do-\">What can Jenkins-LSCI do?</h2>\n<p>Jenkins-LSCI enables research scientists to build workflows and data pipelines on the same robust framework and plugin ecosystem as <a href=\"https://jenkins.io/\">Jenkins-CI</a>, the widely used continuous integration server that supports building, deploying and automating any software project.</p>\n<h2 id=\"high-content-image-analysis-with-jenkins-lsci-and-cellprofiler\">High Content Image Analysis with Jenkins-LSCI and CellProfiler</h2>\n<p>To demonstrate the utility of Jenkins-LSCI as an integration platform for life-sciences research applications, we provide a set of Jenkins-LSCI jobs that can enhance the usability of <a href=\"http://cellprofiler.org\">CellProfiler</a> in a high performance workflow for high content screening image analysis. In addition, these jobs can form the basis for managing and sharing imaging pipelines and data in ways that can enhance scientific collaboration and reproducibility.</p>\n<p>These related Jenkins-LSCI jobs enable users to:</p>\n<ol>\n<li>Create a library of re-usable, annotated CellProfiler pipelines.</li>\n<li>Create a library of re-usable, annotated CellProfiler image lists</li>\n<li>Prepare task arrays for CellProfiler high performance image analysis (CellProfiler batch mode) on a Linux cluster</li>\n</ol>\n<h2 id=\"what-are-the-advantages-\">What are the advantages?</h2>\n<ul>\n<li><p>Image analysis pipelines, image lists, and generated measurements are all managed by the Jenkins-LSCI server and can be reviewed, shared and reused in multiple ways thus building a <strong>collaborative foundation for reproducible research</strong>.</p>\n</li>\n<li><p>CellProfiler can be parallelized to execute on a <strong>high performance</strong> compute cluster.</p>\n</li>\n<li><p>High performance image analysis becomes <strong>accesible to laboratory scientists</strong>.</p>\n</li>\n<li><p>All functionality is <strong>web-accessible</strong>. Users do not need to install CellProfiler locally, or run CellProfiler with the potentially limited compute resources of their local workstation/laptop.</p>\n</li>\n<li>This basic set of jobs can be <strong>easily extended</strong> with jobs for data and imaging utilities as the computational needs of the laboratory demand.</li>\n</ul>\n<h2 id=\"the-jenkins-lsci-cellprofiler-jobs\">The Jenkins-LSCI-CellProfiler Jobs</h2>\n<h3 id=\"os_contribute_pipeline\">OS_CONTRIBUTE_PIPELINE</h3>\n<p>The <code>OS_CONTRIBUTE_PIPELINE</code> job allows users to annotate and upload a CellProfiler pipeline to the Jenkins server. The build generates a pipeline summary report combining user and internal pipeline annotations. The pipeline is stored on the Jenkins server and can be used by CellProfiler running on a remote cluster or workstation, or on the user&#39;s desktop.</p>\n<h3 id=\"os_contribute_imagelist\">OS_CONTRIBUTE_IMAGELIST</h3>\n<p>The <code>OS_CONTRIBUTE_IMAGELIST</code> job facilitates the creation and management of correctly formatted image lists that can be used for processing large number of images through a CellProfiler pipeline. Image processing is highly dependent on image acquisition and experimental metadata (wavelengths, plates, wells, fields, time-points, Z-stacks etc.) We support the direct parsing of metadata generated during the image acquisition phase from the <strong>InCell</strong> and <strong>Yokogawa</strong> scientific imagers.</p>\n<p>In the absence of instrument metadata, image lists can be created using the CellProfiler desktop client. These image lists can then be easily adapted using the <code>OS_CONTRIBUTE_IMAGELIST</code> job to formats compatible with high performance cluster analysis.</p>\n<h3 id=\"os_cellprofiler_batch\">OS_CELLPROFILER_BATCH</h3>\n<p>The <code>OS_CELLPROFILER_BATCH</code> job allows users to generate correctly formatted CellProfiler task array scripts that can be submitted to a Linux cluster for parallel processing. The job builds take as input a reference to an <code>OS_CONTRIBUTE_PIPELINE</code> build and a reference to an <code>OS_CONTRIBUTE_IMAGELIST</code> build. Theses builds define the two inputs for a typical CellProfiler run, the image processing pipeline and the image list.</p>\n<p>The task array script is currently formatted for the <a href=\"http://www.univa.com/products/\">UNIVA grid engine</a> scheduler and it should require little effort to customize for other cluster schedulers. However, due to the non-standardized, local, Linux cluster environment and installed software dependencies, the task array submission process is left up to the user. In addition, CellProfiler and its library dependencies must be installed and correctly working on the destination Linux cluster.</p>\n<h3 id=\"os_cellprofiler_jclustbatch\">OS_CELLPROFILER_JCLUSTBATCH</h3>\n<p>The <code>OS_CELLPROFILER_JCLUSTBATCH</code> job is an example CellProfiler on cluster job that includes the steps for, creating task arrays, submitting them to the UNIVA grid engine, monitoring the task array execution, and finally merging the individual CellProfiler task output generated on the Linux cluster.</p>\n<p>Due to its high dependency on the Novartis cluster infrastructure this job is unlikely to run unmodified on other Linux clusters, but it provides a useful and complete exemplar on how Jenkins-LSCI is used to integrate a complex workflow and monitor an external job.</p>\n<h2 id=\"test-drive-jenkins\">Test Drive Jenkins</h2>\n<p>If you would like to quickly <a href=\"https://wiki.jenkins-ci.org/display/JENKINS/Meet+Jenkins\">test drive Jenkins-CI</a> you can <a href=\"http://mirrors.jenkins-ci.org/war/latest/jenkins.war\">download jenkins.war</a> directly and launch it by executing <code>java -jar jenkins.war</code>. Once it launches, visit <code>http://localhost:8080/</code> in your browser to get to the dashboard. On Windows, you can even choose to install <a href=\"https://wiki.jenkins-ci.org/display/JENKINS/Installing+Jenkins+as+a+Windows+service\">Jenkins as a service</a> afterwards.</p>\n<h2 id=\"jenkins-lsci-installation-configuration\">Jenkins-LSCI Installation &amp; Configuration</h2>\n<p>A fully functional Jenkins-LSCI server supporting CellProfiler image analysis requires the installation and configuraton of the following software components:</p>\n<ol>\n<li>A mirror of the Jenkins-LSCI project code (from git)</li>\n<li><a href=\"https://jenkins.io/\">Jenkins-CI</a> and required Jenkins plugins</li>\n<li><a href=\"http://cellprofiler.org\">CellProfiler</a></li>\n</ol>\n<p>Please, refer to the <a href=\"./userContent/docs/installation_and_use.html\">Jenkins-LSCI Installation and Usage</a> for more details</p>\n<h2 id=\"getting-help\">Getting Help</h2>\n<p>For general assistance with Jenkins-CI you can consult the <a href=\"https://groups.google.com/forum/#!forum/jenkinsci-users\">Jenkins Google user group</a> and the extensive, community-maintained <a href=\"https://wiki.jenkins-ci.org/display/JENKINS/Use+Jenkins\">Jenkins-CI wiki</a></p>\n<p>For general assistance with CellProfiler you can consult the <a href=\"http://forum.cellprofiler.org/\">CellProfiler User Group</a></p>\n<p>The <a href=\"http://biouno.org\">BioUno</a> open source project and <a href=\"https://groups.google.com/forum/#!forum/biouno-users\">BioUno Google user group</a> can provide additional guidance and assistance in setting up Jenkins for bioinformatics and data science applications</p>\n<h2 id=\"license\">License</h2>\n<p>The Jenkins-LSCI code is provided under the <a href=\"http://www.apache.org/licenses/LICENSE-2.0.txt\">Apache 2.0</a> license</p>\n"}