{"slug":"yada","metadata":{"name":"YADA","abbreviation":"yada","projectName":"yada","launched":"2015-10-25T00:00:00.000Z","summary":"A universal remote control for data.","description":"<p>Enable efficient, non-redundant development of data-dependent applications and utilities, data source querying, data analysis, processing pipelines, extract, transform, and load (ETL) processes. YADA does all this while preserving total decoupling between data access and other aspects of application architecture such as user interface.</p>\n","dateString":"Sun Oct 25 2015","title":"YADA","styles":[],"scripts":[]},"html":"<h2 id=\"why-yada-\">Why YADA?</h2>\n<img src=\"https://github.com/Novartis/YADA/raw/master/src/site/resources/images/blox250.png\"/>\n\n<p><strong>YADA</strong> is like a <a href=\"https://en.wikipedia.org/wiki/Universal_remote\"><em>Universal Remote Control</em></a> for data.</p>\n<p>For example, what if you could access</p>\n<ul>\n<li><em>any</em> data set</li>\n<li>at <em>any</em> data source</li>\n<li>in <em>any</em> format</li>\n<li>from <em>any</em> environment</li>\n<li>using <em>just</em> a URL</li>\n<li>with just <em>one-time</em> configuration?</li>\n</ul>\n<p>You can with <strong>YADA</strong>.</p>\n<p>Or, what if you could get data</p>\n<ul>\n<li>from <em>multiple</em> sources</li>\n<li>in <em>different</em> formats,</li>\n<li><em>merging</em> the results</li>\n<li>into a <em>single</em> set</li>\n<li><em>on-the-fly</em></li>\n<li>with <em>uniform</em> column names</li>\n<li>using <em>just one</em> URL?</li>\n</ul>\n<p>You can with <strong>YADA</strong>.</p>\n<h2 id=\"what-is-yada-\">What is YADA?</h2>\n<p><strong>YADA</strong> exists to simplify data access and eliminate work.</p>\n<p><strong>YADA</strong> is secure.</p>\n<p><strong>YADA</strong> is a lightweight framework for data retrieval, searching, storage, and manipulation.</p>\n<p><strong>YADA</strong> is an instant web service for your data.</p>\n<p><strong>YADA</strong> is a tool to enable efficient development of interfaces and data-processing pipelines.</p>\n<p><strong>YADA</strong> is as an implementation of <a href=\"http://bit.ly/1dhuiRY\">Thin Server Architecture</a>.</p>\n<p><strong>YADA</strong> is anti-middleware.</p>\n<p><strong>YADA</strong> is an acronym for &quot;Yet Another Data Abstraction.&quot;</p>\n<p><strong>YADA</strong> is an open source software framework distributed by <a href=\"http://opensource.nibr.com\">Novartis Institutes for BioMedical Research</a> under the <a href=\"http://www.apache.org/licenses/LICENSE-2.0.html\">Apache 2.0 license</a>.</p>\n<p>Its <a href=\"http://bit.ly/1SHuiAd\">raisons d&#39;être</a> are to enable efficient, non-redundent development of data-dependent applications and utilities, data source querying, data analysis, processing pipelines, extract, transform, and load (ETL) processes, etc. <strong>YADA</strong> does all this while preserving total decoupling between data access and other aspects of application architecture such as user interface.</p>\n<h2 id=\"still-like-huh-\">Still like &quot;Huh?&quot;</h2>\n<p><strong>YADA</strong> is a software framework, which means it is a collection of software tools forming a basic structure underlying a system, for developers and data analysts to use to create new tools and solutions in a new way.</p>\n<p>The novelty and utility of YADA lies in its centralization of management of data source access configuration. It simplifies these aspects of software development by eliminating many steps, thereby enabling rapid development, standardization of access methods, and the code in which these methods are implemented. Further it strongly encourages reuse of existing configurations (once configured.)</p>\n<p>As a result of these configuration facilities, YADA enables the aggregation or integration of data from multiple data sources using a standard method, agnostic with regard to any vendor or technology-specific details of disparate data source implementations.</p>\n<p>For example, the conventional method to access, or furthermore, combine data from say, an Oracle® database, and a web service, is to write code which connects to each database or service independently using different methods and libraries, write code to execute embedded queries independently, also using different methods and libraries, and write code to parse and aggregate the separately acquired data sets. Then the data is typically fed to an analysis tool.</p>\n<p>With YADA, the data source connections and application-specific queries are stored securely and centrally, the queries are executed using identical methods (despite the different sources,) and the data can be integrated or aggregated on-the-fly.</p>\n<p>For software developers and data analysts alike, these features offer potentially tremendous time savings, faster time-to-delivery, and a larger percentage of time focused not on the tedium of configuration, but on the specific context of a software solution or data analysis.</p>\n<h2 id=\"what-s-in-this-document-\">What&#39;s in this document?</h2>\n<p>This document contains an overview of the framework and features. Check out the <a href=\"src/site/markdown/deployment.md\">Quickstart/Deployment Guide</a> for details on getting started.</p>\n<h3 id=\"table-of-contents\">Table of Contents</h3>\n<ol>\n<li><a href=\"#other\">Other Documentation</a></li>\n<li><a href=\"#mindset\">Getting into the YADA Mindset</a></li>\n<li><a href=\"#features\">Features</a></li>\n<li><a href=\"#arch\">Architecture</a></li>\n<li><a href=\"#history\">History</a></li>\n<li><a href=\"#apps\">YADA Apps and Uses</a></li>\n<li><a href=\"#sources\">Data Sources</a></li>\n<li><a href=\"#plugins\">Plugins</a></li>\n<li><a href=\"src/site/markdown/deployment.md\">Installation</a> (links directly to the <a href=\"src/site/markdown/deployment.md\">Quickstart/Deployment Guide</a>)</li>\n<li><a href=\"#license\">License</a></li>\n<li><a href=\"#issues\">Known Issues</a></li>\n</ol>\n<p><a name=\"other\"></a></p>\n<h2 id=\"other-documentation\">Other Documentation</h2>\n<h3 id=\"getting-started\">Getting Started</h3>\n<ul>\n<li><a href=\"src/site/markdown/deployment.md\">Quickstart/Deployment Guide</a></li>\n</ul>\n<h3 id=\"advanced-documentation\">Advanced Documentation</h3>\n<ul>\n<li><a href=\"src/site/markdown/admin.md\">YADA Admin Guide</a></li>\n<li><a href=\"src/site/markdown/guide.md\">User Guide</a></li>\n<li><a href=\"src/site/markdown/security.md\">Security Guide</a></li>\n<li><a href=\"src/site/markdown/pluginguide.md\">Plugin Use and Development Guide</a></li>\n<li><a href=\"src/site/markdown/testing.md\">Testing Notes</a></li>\n</ul>\n<h3 id=\"specifications\">Specifications</h3>\n<ul>\n<li><a href=\"http://opensource.nibr.com/yada/yada-api/apidocs/index.html\">Javadoc</a></li>\n<li><a href=\"src/site/markdown/params.md\">YADA Parameter Specification</a></li>\n<li><a href=\"src/site/markdown/jsonparams.md\">JSONParams Specification</a></li>\n<li><a href=\"src/site/markdown/harmony.md\">Harmonizer Guide and Specification</a></li>\n<li><a href=\"src/site/markdown/uml.md\">Java® Visual Reference</a></li>\n<li><a href=\"src/site/markdown/filters.md\">Filters Specification</a></li>\n<li><a href=\"src/site/markdown/mail.md\">Mail Specification</a></li>\n</ul>\n<p><a name=\"mindset\"></a></p>\n<h2 id=\"getting-into-the-yada-mindset\">Getting into the YADA Mindset</h2>\n<p>YADA exists to simplify data access and eliminate work.</p>\n<p>YADA may be exactly what you&#39;ve been looking for, or it may be a solution to a problem you didn&#39;t know you had. YADA is the perfect tool for many use-cases. Here are a few examples. Suppose you are a</p>\n<h3 id=\"scientist-or-data-analyst-\">Scientist or Data Analyst...</h3>\n<p>The new numbers are in from the lab, or from last night&#39;s feed, and uploaded to your database or data warehouse. You want to create a new visualization in your favorite statistical analysis package, but you&#39;re not sure how to connect to the database. Your data gal helped you set it up in Python once, but since then, you just run the script to get the data. Now you need it in a different environment.</p>\n<p>If your data gal had set up a <strong>YADA</strong> query for your datasource, you could simply run the query in your web browser to download the data, or use any module that will retrieve data from a url. You can reuse the <em>very same query</em> that was already configured for your other tasks.</p>\n<h3 id=\"datasource-owner-curator-\">Datasource Owner/Curator...</h3>\n<p>Your constituents want their data, and they call you. Everyone wants basically the same set of columns but with a different &quot;WHERE&quot; clause, i.e., they each want a different subset of rows. Some can handle connection strings, but most can&#39;t.</p>\n<p>So you configure your datasource in the <strong>YADA</strong> server, store a query, and send the same url to every one, explaining to them where to plug in the values in the query parameter string so they get only the data they want. They might see some columns they don&#39;t want but they can easily ignore them. If someone complains, heck, you just store another similar query with a different name, and voilà.</p>\n<h3 id=\"software-user-interface-developer-\">Software User Interface Developer...</h3>\n<p>You hate middleware. Every time you want to extend the data model, you have to change your Resource layer, your DAO layer, your DAOImpls, your DTOs, your Model classes, your UI code, etc. You might have to touch 20 files to add one field.</p>\n<p>Not so with <strong>YADA</strong>.</p>\n<p>With <strong>YADA</strong>, you change your stored query, and you change the code that executes the stored query, whether it&#39;s a javascript-based ajax call, or a perl LWP request, or a curl call from a shell script. As long as your client speaks HTTP, <strong>YADA</strong> will deliver your data.</p>\n<h3 id=\"software-middleware-developer-\">Software Middleware Developer...</h3>\n<p>Even you, middleware guy, can benefit from <strong>YADA</strong>.</p>\n<p>Maybe you have to provide a RESTful interface to an existing application, and need to deliver in such a short window, or have only a handful of users, so a fully-specified REST service is not practical. Maybe you need to access an existing REST interface and can&#39;t use your own proxy script; or, you have to grant access to a unix filesystem without mapping it in Apache or changing privileges. Perhaps the business wants to integrate some existing perl-based pipeline processes into a user interface or your Javascript UI team is already using <strong>YADA</strong>, and needs a Java® plugin to post-process data it&#39;s retrieving from a third party.</p>\n<h2 id=\"features\">Features</h2>\n<ul>\n<li>Data vendor- and technology-agnostic</li>\n<li>Accesses any JDBC, SOAP, or REST, and some Filesystem datasources</li>\n<li>Delivers data as JSON (default), XML, or CSV, TSV, Pipe, or custom-delimited, natively, and in any other format via custom Response and Converter classes, or Plugins</li>\n<li>4-layer security model including url and token validation, query-execution authorization, and dynamic-predicate-based, pre-execution, row-level filtering</li>\n<li>Dynamic datasource configuration</li>\n<li>Executes multiple queries in a single HTTP request</li>\n<li>On-the-fly inner and outer joins across disparate data sources</li>\n<li>Ad hoc Harmonization (i.e., single http request to multiple data sources with harmonized results)</li>\n<li>Utilizes JDBC transactions (e.g., multiple inserts in a single HTTP request, with a single commit/rollback)</li>\n<li>Commits a single query or an entire request</li>\n<li>Processes file uploads</li>\n<li>Compatible with any client that speaks HTTP (e.g., web browser, python, curl, javascript, spotfire, curl, web service, mobile app, etc)</li>\n<li>Flexible Java® and Script plugin API to preprocess request parameters, post-process results, or override normal processing altogether</li>\n<li><a href=\"http://www.ehcache.org/\">EhCache</a> query-index caching</li>\n<li>Security (via Cookie forwarding and/or Default Plugins)</li>\n<li>Support for Oracle®, MySQL®, Vertica®, PostgreSQL®, HyperSQL®, SQLite®</li>\n<li>Tomcat 8 and JDK 1.8-compatible (YADA 8)</li>\n<li><em>Coming Later</em>: ElasticSearch® support</li>\n<li><em>Coming Later</em>: ElasticSearch®-based result and aggregate-result caching</li>\n<li><em>Coming Later</em>: Dynamic memory management and caching to facilitate large-scale request queuing and high volume result transformation in high frequency environments</li>\n<li><em>Coming Later</em>: SQL DDL</li>\n<li><em>Coming Later</em>: MongoDB® and other NoSQL support</li>\n<li><em>Coming Later</em>: SQL Server® support</li>\n<li><em>Coming Later</em>: Node.js® port (maybe?)</li>\n<li><em>Coming Later</em>: Scala?</li>\n<li><em>Coming Later</em>: Standalone java application</li>\n<li><em>Coming Later</em>: Spark-based result post-processor</li>\n</ul>\n<p><a name=\"arch\"></a></p>\n<h2 id=\"architecture\">Architecture</h2>\n<p>A quick overview of the architecture</p>\n<h3 id=\"generic\">Generic</h3>\n<p>About as basic as it can be...\n<img src=\"https://github.com/Novartis/YADA/raw/master/src/site/resources/images/generic-arch.png\" alt=\"generic architecture\" title=\"Generic Architecture\"></p>\n<h3 id=\"specific\">Specific</h3>\n<p>...and a little bit more specific:</p>\n<blockquote>\n<p>Note the image indicates Tomcat 6. It should be Tomcat <strong>7</strong></p>\n</blockquote>\n<p><img src=\"https://github.com/Novartis/YADA/raw/master/src/site/resources/images/specific-arch.png\" alt=\"specific architecture\" title=\"Specific Architecture\"></p>\n<p><a name=\"history\"></a></p>\n<h2 id=\"history\">History</h2>\n<p>YADA grew organically from a reverse-engineering effort.</p>\n<p>Over the course of a few years, a scientist had developed an array of Perl CGI applications with thousands of lines of embedded SQL and Javascript.</p>\n<p>Then he abruptly left the company.</p>\n<p>He was not a trained, nor experienced software developer, he made little use of third party libraries, and violated a lot of conventions.</p>\n<p>To gain an understanding of his code in order to maintain, extend, or replace it, SQL queries were extracted from the code, stored in a database, and given unique names.</p>\n<p>A &quot;finder&quot; function was written in Perl to retrieve the SQL by name.</p>\n<p>This &quot;finder&quot; was extended to support the passing of parameters.</p>\n<p>Soon thereafter, this perl utility was ported to Java®. The burgeoning framework was extended further to support multiple data types, INSERT, UPDATE, and DELETE statements in addition to SELECT statements, JDBC transactions, SOAP queries, plugins, I/O, and so on.</p>\n<p><a name=\"apps\"></a></p>\n<h2 id=\"yada-apps-and-uses\">YADA &quot;Apps&quot; and uses</h2>\n<p>Most YADA &quot;Apps&quot; are <a href=\"http://en.wikipedia.org/wiki/Single-page_application\">single-page Javascript applications</a> running in web browsers. YADA is also heavily utilized by data analysts and bioinformaticians who need parameterized, delimited data subsets imported into their analysis tools such as R and Spotfire, or to be used by Perl or Python-based data processing pipelines.</p>\n<p><a name=\"sources\"></a></p>\n<h2 id=\"data-sources\">Data Sources</h2>\n<p>YADA ships with scripts for using, as the YADA Index:</p>\n<ul>\n<li>MySQL®</li>\n<li>PostgreSQL®</li>\n<li>HyperSQL®</li>\n<li>SQLite®</li>\n<li>Oracle®</li>\n</ul>\n<p>Soon the index will be stored in ElasticSearch®, but ultimately, it is vendor-agnostic. Other supported data sources currently include</p>\n<ul>\n<li>Vertica®</li>\n<li>SOAP</li>\n<li>REST</li>\n</ul>\n<p>MongoDB®, SQL Server®, and other datasource compatibility will be added soon.</p>\n<p><a name=\"plugins\"></a></p>\n<h2 id=\"plugins\">Plugins</h2>\n<p>For detailed information about plugin use and development, see the <a href=\"src/site/markdown/pluginguide.md\">Plugin Use and Development Guide</a>.</p>\n<p>The plugin API is versatile. Plugins can be written in java, or in any scripting language supported on the YADA server. Plugins can be applied at the request level, affecting the entire request, or it&#39;s output, or at the query level, affecting just a single query in a request. The conceptual, or implementation hierarchy of the plugin API (not to be confused with the actual package hierarchy) is reflected in the diagram below, from two different perspectives.</p>\n<p><img src=\"https://github.com/Novartis/YADA/raw/master/src/site/resources/images/plugin-concept.png\" alt=\"Plugin Concept\" title=\"Plugin Concept\"></p>\n<h3 id=\"plugin-types\">Plugin Types</h3>\n<h4 id=\"pre-processors\">Pre-Processors</h4>\n<p>These are intended to manipulate URL parameters, either by removing, appending, or modifying them.</p>\n<h4 id=\"post-processors\">Post-Processors</h4>\n<p>These are intended to modify results returned by queries. For example, an XSL Post-Processor might accept XML-formatted results and transform them before returning the to the client. Uploaded file processors, i.e., batch handlers, are post-processors.</p>\n<h4 id=\"bypassers\">Bypassers</h4>\n<p>These circumvent conventional YADA query processing. Effectively, anything is possible in a Bypass. Bypass plugins are popular ETL tools and bulk data loaders.</p>\n<p><a name=\"license\"></a></p>\n<h2 id=\"license\">License</h2>\n<p>Copyright &copy; 2016 <a href=\"http://opensource.nibr.com\">Novartis Institutes for Biomedical Research</a></p>\n<p>Licensed under the Apache License, Version 2.0 (the &quot;License&quot;); you may not use this file except in compliance with the License. You may obtain a copy of the License at <a href=\"http://www.apache.org/licenses/LICENSE-2.0\">http://www.apache.org/licenses/LICENSE-2.0</a></p>\n<p>Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an &quot;AS IS&quot; BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.</p>\n<p><a name=\"issues\"></a></p>\n<h3 id=\"known-issues-last-updated-25-oct-2015-\">Known Issues (last updated 25-OCT-2015)</h3>\n<ul>\n<li>Date and time value syntax, just like in the real world, are database-vendor specific. Use vendor-specific literals and functions. Check the test queries for guidance.</li>\n<li>Speaking of dates and times, right now the TestNG tests which validate date and time values pass only on machines in the &quot;America/NewYork&quot; timezone. This is likely because the insert statements used to put the test data into the test table is not specific.</li>\n<li>There are two drivers for SQL Server®. The one I picked has problems, and I haven&#39;t made time to work with the other.</li>\n</ul>\n"}